export const Arabic = {
  test: "مرحبا احمد",
  // Header
  navLi1: "الرئيسية",
  navLi2: "الخدمات",
  navLi3: "الخطوات",
  navLi4: "اعمالنا",
  navLi5: "عنا",
  navBtn: "تواصل معنا",
  //ServicesNav
  servTitle1: "تصميم واجهة وتجربة مستخدم",
  servTitle2: "تطوير المواقع الالكترونية",
  servTitle3: "تطوير تطبيقات الهاتف",
  servDesc1:
    "نحرص على أن يكون كل تصميم نقوم به ليس مجرد مظهر؛ بل هو خطوة في بناء علاقة أقوى بين منتجك ومستخدميه.",
  servDesc2:
    "نحرص على أن يكون كل تفصيل في التطبيق مصممًا ومبرمجًا بعناية ليخدم رؤيتك.",
  servDesc3:
    "عندما يبدأ المستخدم رحلته مع تطبيقك، يجب أن تكون التجربة ملهمة وسلسة من اللحظة الأولى.",
  // Footer
  footerT1: "اجزاء الموقع",
  footerT2: "خدماتنا",
  footerT3: "تواصل معنا",

  // Ui UX Service
  uiuxHeroTitle: 'تصميم واجهات المستخدم وتجربة الاستخدام.',
  uiuxHeroText: "نحن نصمم تجربة شاملة تمنح المستخدمين إحساسًا بالانغماس في بيئة مريحة تحفزهم على التفاعل والعودة مجددًا. كل تصميم نقدمه لا يقتصر على الشكل فحسب؛ بل يمثل جزءًا من تعزيز الروابط بين منتجك والمستخدمين، حيث يتلاقى الجمال مع الأداء في تجربة تتخطى التوقعات. ولا نسعي لتحسين واجهتك فقط !",
  uiuxTextSectionTitle: " كيف يكون تأثير واجهة المستخدم",
  uiuxTextSectionText1: "تخيل واجهة رقمية تتميز بالجمال، وتضمن تجربة سلسة في كل نقرة وحركة. هذا هو جوهر خدماتنا في تصميم واجهة وتجربة المستخدم (UI/UX). نحن نقوم بتحويل الأفكار إلى تجارب رقمية مفعمة بالحياة، حيث يشعر المستخدمون بالراحة والانجذاب منذ البداية.",
  uiuxTextSectionText2: "نبدأ بفهم رؤيتك ومتطلبات جمهورك، ونحولها إلى تصميمات مدهشة تشد الانتباه وتدفع للتفاعل. نركز على تنسيق جميع عناصر التصميم، مما يجعل المستخدمين يشعرون وكأنهم في مكان مألوف يدعوهم للاكتشاف والعودة.",
  uiuxTextSectionText3: "تصميماتنا ليست مجرد أشكال خارجية؛ بل تمثل مدخلاً تفاعليًا يصل إلى قلوب المستخدمين، ويخلق رابطًا قويًا بين منتجك وجمهورك. نحن نبني واجهات تجعل المستخدمين يشعرون بأنهم جزء من تجربة متكاملة تتجاوز توقعاتهم.",
  uiuxWhyWe1Title: "تصاميم إبداعية",
  uiuxWhyWe1Text: "كل تصميم يبدأ بفكرة، لكن التحويل الحقيقي لهذه الفكرة إلى قصة بصرية مؤثرة هو ما يميز الإبداع. نحن نبدأ بفهم رؤيتك وأهدافك، ونبتكر تصاميم تعكس هوية علامتك التجارية. كل عنصر في التصميم، سواء كان خطًا أو لونًا أو تفصيلًا، يترجم فكرتك بوضوح.",
  uiuxWhyWe2Title: "تحليل الجمهور المستهدف",
  uiuxWhyWe2Text: "نستوعب جمهورك بعمق، مما يسمح لنا بإنشاء واجهات تتناسب مع اهتماماتهم وسلوكياتهم. هذا الفهم الدقيق يضمن أن المنتج النهائي ليس فقط جذابًا بل يتفاعل بفعالية مع احتياجات المستخدمين.",
  uiuxWhyWe3Title: "حلول فعالة",
  uiuxWhyWe3Text: "نقدم حلول تطوير برمجية فعّالة تركز على تعزيز الأداء وزيادة الكفاءة، لضمان تحقيق أهدافك بأفضل شكل ممكن. باستخدام أحدث التقنيات وأفضل الممارسات، نبتكر حلولًا تساهم في تحقيق نتائج ملموسة وملحوظة.",
  whyWe4Title: "تعاون مستمر معك",
  whyWe4Text: "نؤمن أن أفضل النتائج تأتي من التعاون المستمر. نبقى على تواصل معك في كل مراحل التصميم، ونستمع لملاحظاتك، ونعمل جنبًا إلى جنب لضمان أن المنتج النهائي يفوق توقعاتك.",
  whyWe5Title: "دعم مستمر",
  whyWe5Text: "رحلتك معنا لا تتوقف عند إطلاق موقعك أو تطبيقك. نقدم لك دعمًا  مستمرًا لضمان بقاء منتجك الرقمي في أفضل حالاته. سواء كنت بحاجة إلى تحديثات دورية، إصلاحات عاجلة، أو تحسينات في الأداء، نحن هنا لدعمك في كل مرحلة.",
  // Web Service
  webHeroTitle: 'تطوير و بناء المواقع الالكترونية',
  webHeroText: "كل مشروع ويب نبدأه بفكرة تلبي احتياجاتك وتحقق طموحاتك. نحول هذه الفكرة إلى واقع رقمي عبر برمجة دقيقة. نطور تطبيقات ويب عالية الأداء بتجربة مستخدم سلسة، مع اهتمام كامل بكل التفاصيل لتحقيق رؤيتك.",
  webTextSectionTitle: "كيف نجعل موقعك الالكتروني",
  webTextSectionText1: "كل مشروع لتطوير تطبيق ويب يبدأ بفكرة، ووراءها فريق متخصص يقوم بتحويل هذه الفكرة إلى واقع ملموس. نحن لا نقتصر على البرمجة فقط، بل نصمم تطبيقات ويب تتميز بالقوة، وكفاءة الأداء، وتجربة مستخدم متكاملة. نحن لا نصنع تطبيقات ويب فقط، بل نخلق تجارب رقمية تمثل مستقبل أعمالك وتضعك في مقدمة السوق. نستخدم أحدث التقنيات لضمان أن يكون تطبيقك ليس فعالًا فحسب، بل يتفوق في السوق ويخدم جمهورك بأفضل شكل.",
  webTextSectionText2: "لكن السر في النجاح يكمن في الخطوات التي تلي هذه الفكرة. كل عنصر في التصميم والبرمجة يتمتع بعناية دقيقة لضمان أن تكون النتيجة النهائية منتجًا رقميًا يلفت الانتباه ويحقق احتياجات المستخدمين. وهذا يعني أنه ليس جاهزًا للإطلاق فحسب، بل مستعد لتحقيق النجاح المستدام.",
  webWhyWe1Title: "تجربة متقدمة",
  webWhyWe1Text: "استمتع بتجربة مستخدم متقدمة باستخدام أحدث تقنيات تطوير الويب، حيث نوفر لك تجربة تصفح سلسة وسهلة. نعمل على تحسين كل تفاصيل التفاعل لضمان تقديم تجربة مميزة تعزز رضا المستخدمين.",
  webWhyWe2Title: "مواقع مبتكرة",
  webWhyWe2Text: "نمزج بين الإبداع والتكنولوجيا لتصميم مواقع إلكترونية مبتكرة تلبي احتياجات عملك وتفوق توقعاتك. نستخدم تقنيات متطورة وأفكارًا جديدة لضمان تقديم حلول فريدة تدعم نمو عملك في كل مشروع.",
  webWhyWe3Title: "تصميم متجاوب",
  webWhyWe3Text: "في عالم يتطلب الاتصال المستمر، يجب أن يعمل موقعك بسلاسة على جميع الأجهزة. نحن نصمم مواقع متجاوبة تتأقلم مع مختلف أحجام الشاشات لضمان تجربة مستخدم سلسة ومتكاملة، بغض النظر عن كيفية وصولهم إلى الموقع.",
  // Mobile Service
  mobileHeroTitle: "تطوير تطبيقات الهاتف",
  mobileHeroText: "عند بدء المستخدم رحلته في تطبيقك، يجب أن تكون التجربة سلسة وجذابة منذ البداية. نفهم أن تطوير التطبيقات ليس مجرد برمجة، بل هو قصة تُحكى مع كل تفاعل. نصمم تطبيقات تجذب المستخدمين وتأخذهم في تجربة متكاملة، من واجهة مميزة إلى وظائف ذكية.",
  mobileTextSectionTitle: "كيف نأخذ تطبيقك إلي أبعد",
  mobileTextSectionText1: "نحن نفهم أن التفاعل بين المستخدم وتطبيقك هو ما يحدد نجاحه في سوق مليء بالتطبيقات. كل تطبيق لديه قصة فريدة تستحق أن تروى، ومهمتنا هي تحويل رؤيتك إلى تطبيق مميز يجذب انتباه المستخدمين منذ اللحظة الأولى ويضمن تجربة تجذبهم للعودة مرة أخرى. نبدأ بدراسة جمهورك المستهدف واحتياجاته لضمان تصميم تطبيق يلبي توقعاتهم ويحقق رغباتهم بشكل دقيق.",
  mobileTextSectionText2: "كل جزء من التطبيق، من التصميم البصري إلى الأداء الوظيفي، يهدف إلى تعزيز هوية علامتك التجارية. ندمج أحدث التقنيات مع إبداع التصميم لنضمن تجربة مستخدم سلسة وممتعة. كما نضمن أن يعمل التطبيق بكفاءة على مختلف الأجهزة وأنظمة التشغيل، مع تحسينات للأداء لضمان سرعة واستجابة عالية.",
  mobileTextSectionText3: "نحن هنا لنتأكد من أن التطبيق يتجاوز كونه أداة ليصبح تجربة متكاملة تخلق جسوراً من الثقة والولاء بينك وبين جمهورك. من خلال تعاوننا، سنصنع تطبيقاً لا يقتصر على جذب الانتباه، بل يحافظ عليه، محولاً كل تفاعل إلى لحظة ملهمة يرغب المستخدمون في مشاركتها.",
  mobileWhyWe1Title: " أداء متميز",
  mobileWhyWe1Text: "نؤمن أن نجاح أي تطبيق يتوقف على أدائه وفعاليته. لذا، نركز على تطوير تطبيقات تتمتع بأداء رائع وسهولة في الاستخدام، مما يضمن تجربة استثنائية لمستخدميك ويعزز تفاعلهم مع خدماتك.",
  mobileWhyWe2Title: "فعالية مضمونة",
  mobileWhyWe2Text: "في مجال تطوير التطبيقات، تعتبر الفعالية والجودة ليست مجرد خيارات بل هما الركيزتان الأساسيتان. نحن ملتزمون بتقديم حلول تقنية تجمع بين الأداء الموثوق والجودة العالية لضمان نجاح مشاريعك الرقمية.",
  mobileWhyWe3Title: "كفاءة لا تضاهى",
  mobileWhyWe3Text: "نطمح لتحقيق كفاءة عالية في التطبيقات في كل مشروع. نحن نعمل بجد لضمان توفير حلول برمجية تتوافق مع معايير صارمة للجودة والأداء، مما يضمن لك تطبيقات تتميز بالسرعة والفعالية.",
  // common service hero section button
  heroBtnText: 'ابدأ رحلتك',
  // get your offer now section 
  getYourOfferTitle: "استلم عرضك اليومي فوراً !",
  getYourOfferText: "عند الطلب من خلال الموقع ستحصل علي عرض خاص بك.",
  // service projects
  serviceProjectsTitle: "أعمالنا الناجحة التي تحكي عن",
  // whyWe Section
  whyWeTitle: "لماذا تختارنا نحن؟",
  
  // DailyOffer
  dO_h1: "لا تتردد، انضم إلينا واطلب عرضك اليومي الآن!",
  dO_p: "عند تقديم طلبك عبر الموقع، ستحصل على عرض خاص لك",
  dO_btn: "تواصل معنا",
  // TeamDC
  teamTitle: "فريقنا المبدع",
  teamDesc: "نعمل جاهدين على تطبيق أفكارك بإبداع لتعزيز هوية علامتك التجارية على أرض الواقع.",
  FED1: "احمد الكواوي",
  FED2: "محمود امين",
  FED3: "امير مسلم",
  FED4: "ايه فرح",
  BED1: "احمد مجدي",
  BED2: "رحمه عاطف",
  FLD1: "احمد ايمن",
  UiUxD1: "علا اشرف",
  UiUxD2: "ندي عبد الرازق",
  PM: "محمد الشهابي",

};
