export const Arabic = {
  test: "مرحبا احمد",
  // Header
  navLi1: "الرئيسية",
  navLi2: "الخدمات",
  navLi3: "الخطوات",
  navLi4: "اعمالنا",
  navLi5: "عنا",
  navBtn: "تواصل معنا",
  //ServicesNav
  servTitle1: "تصميم واجهة وتجربة مستخدم",
  servTitle2: "تطوير المواقع الالكترونية",
  servTitle3: "تطوير تطبيقات الهاتف",
  servDesc1:
    "نحرص على أن يكون كل تصميم نقوم به ليس مجرد مظهر؛ بل هو خطوة في بناء علاقة أقوى بين منتجك ومستخدميه.",
  servDesc2:
    "نحرص على أن يكون كل تفصيل في التطبيق مصممًا ومبرمجًا بعناية ليخدم رؤيتك.",
  servDesc3:
    "عندما يبدأ المستخدم رحلته مع تطبيقك، يجب أن تكون التجربة ملهمة وسلسة من اللحظة الأولى.",
  // Footer
  footerT1: "اجزاء الموقع",
  footerT2: "خدماتنا",
  footerT3: "تواصل معنا",

  // About Us

  aboutHidding1 :"السلام عليكم 👋,   ",
  aboutHidding2:"تعرف علي", 
  aboutHidding3 :"دوت كود",
  aboutDes1:"نحن نقدم لعملائنا حزمة متكاملة من الحلول البرمجية المتطورة,",
  aboutDes2:"تشمل تطوير مواقع الويب، تصميم واجهات وتجربة مستخدم مبتكرة، بالإضافة إلى تطوير تطبيقات الجوال بمستوى عالٍ من الاحترافية. هدفنا هو تحويل أفكاركم إلى واقع رقمي يحقق طموحاتكم",
  whotitl:"من نحن ؟",
  ourworkBtn:"عرض العمل",
  whoDes1:"في دوت كود، نعمل بشغف لتوفير حلول تقنية متكاملة، نركز فيها على تطوير التطبيقات والمواقع الإلكترونية بشكل مخصص لتلبية متطلبات عملك المتغيرة. فريقنا يضم نخبة من المتخصصين في مجالات تطوير البرمجيات وتصميم تجربة المستخدم وواجهة المستخدم (UI/UX)، مما يتيح لنا تقديم حلول إبداعية تسهم في تعزيز تجربة المستخدم وتحقيق أقصى درجات التفاعل الرقمي.",
  whoDes2:"نلتزم باستخدام أحدث التقنيات وأفضل الممارسات العالمية، لضمان تقديم خدمات برمجية ذات كفاءة عالية وقابلية للتوسع، مما يضمن لك أداءً موثوقًا ومستقرًا على المدى الطويل. سواء كنت بحاجة إلى إنشاء منصة تجارة إلكترونية، تطوير تطبيق مخصص، أو بناء حلول برمجية متقدمة تلبي متطلباتك، فإن خبرتنا العميقة تمكننا من تحويل رؤيتك إلى واقع رقمي يلبي تطلعاتك.",
  whoDes3:"نتعاون مع عملاء من مختلف المجالات والصناعات، ونلتزم بتقديم دعم فني مستمر وخدمات صيانة دورية للحفاظ على أداء تطبيقاتك ومواقعك بأفضل صورة ممكنة. نحن نؤمن بأن سر نجاح أي مشروع يكمن في بناء علاقات شراكة طويلة الأمد مع عملائنا، لذلك نحرص على تقديم استشارات مهنية وخطط تطوير استراتيجية، مستندة إلى فهم دقيق لاحتياجات العملاء والسوق المستهدف.",
  whoDes4:"هدفنا لا يقتصر على تقديم حلول برمجية فقط، بل نسعى لتمكين عملائنا من تحقيق النمو المستدام وتوسيع نطاقهم الرقمي. في دوت كود، نضع عملاءنا في صميم كل ما نقوم به، ونعمل على بناء تجارب رقمية مبتكرة تجعل من العالم الرقمي مساحة أكثر تميزًا وفعالية.",

  whyUs1:"لماذا نحن؟",
  whyUs2:"مزايا العمل معنا",
  whydec:"نقدم تصميمات عصرية وجذابة مدعومة بأحدث التقنيات، ونسعى باستمرار لتحقيق أفضل النتائج بأعلى معايير الجودة. نضمن لك أداءً متميزًا وقابلية كبيرة للتوسع، مما يهيئ مشاريعك للنمو والتطور المستدام على المدى البعيد.",
  Btn1:"الجوده",
  Btn2:"رد سريع",
  Btn3:"دعم مستمر",

  Btn1Dec:"تُعتبر الجودة من أهم أولوياتنا في تقديم الخدمات لعملائنا. نحن نسعى باستمرار لتقديم منتجات وخدمات بأعلى معايير الجودة، مع التركيز على التفاصيل الدقيقة لتحقيق أفضل النتائج. كفريق، نؤمن أن الجودة لا تعني فقط تلبية التوقعات، بل تجاوزها من خلال تطوير حلول مبتكرة ومتقنة. نعمل بجد على مراقبة وتحسين أدائنا بشكل مستمر لضمان أن كل ما نقدمه يعكس احترافية وإتقان، مما يساهم في بناء علاقات قوية وطويلة الأمد مع عملائنا.",
  Btn3Dec:"نركز على ضمان أن تكون كل تجربة للمستخدم سلسة وفعّالة وجذابة بصريًا. نعمل بشكل وثيق مع العملاء لفهم احتياجاتهم وتقديم حلول مخصصة، مع معالجة أي مشكلات بسرعة وبشكل استباقي. فريقنا دائمًا على استعداد لتطبيق التحسينات، وتحسين الأداء، وضمان توافق واجهة المستخدم مع أحدث الاتجاهات والتقنيات في التصميم. هذا الدعم المستمر يساعد عملاءنا على الحفاظ على تجربة مستخدم عالية الجودة والبقاء في الطليعة في المشهد الرقمي.",
  Btn2Dec:"يُعتبر الرد السريع جزءًا أساسيًا من تقديم خدمة عملاء متميزة. كفريق، نحرص على الاستجابة الفورية لجميع استفسارات العملاء لضمان معالجة أي أسئلة أو مشاكل قد تواجههم بسرعة وكفاءة. هذا النهج لا يساهم فقط في زيادة رضا العملاء، بل يعكس أيضًا التزامنا بتقديم تجربة دعم سلسة وفعّالة. نحن نسعى دائمًا لجعل التواصل مع العملاء بسيطًا ومباشرًا، مما يعزز الثقة ويعكس مدى احترافية الفريق واهتمامه الحقيقي باحتياجات العميل.",
  knowUsTitle:"اكتشف المزيد عنا!",
  knowUsP1:"نؤمن بأن التعرف على إمكانياتنا الحقيقية يبدأ من الاطلاع على اعمالنا وشراكاتنا الاستراتيجية. نلتزم بتقديم حلول برمجية شاملة تتوافق مع احتياجات السوق المتغيرة، مع الحرص الدائم على تحقيق أعلى مستويات الجودة والابتكار في كل مشروع.",
  knowUsP2:"ندعوك لاكتشاف مشاريعنا السابقة، التي تعكس شراكتنا المثمرة مع عملائنا وتبرز قدرتنا على تحويل الأفكار إلى حلول عملية ذات تأثير ملموس. هدفنا هو بناء مستقبل رقمي قوي، قائم على التعاون المستمر واستخدام أحدث التقنيات.",
  

  // steps
  stepsTitle:"كيف نحقق لك حضورًا مميزًا في العالم الرقمي ؟",
  stepsDesc:"وفقًا لاحتياجاتك والمرحلة الحالية لمشروعك، نقدم لك الدعم من خلال الوسائل التالية",

  comunication:"الاتصال الأولي",
  comunicationP1:"عند تقديم العميل لطلبه عبر النموذج المتاح على الموقع، يتم تصنيف الطلب وفقًا لنوع المشروع، سواء كان ذلك في تطوير المواقع، أو التطبيقات، أو تصميم الواجهات",
  comunicationP2:"يتلقى العميل رسالة بريد إلكتروني تحتوي على تفاصيل طلبه، مع شكر خاص على اهتمامه بخدماتنا. كما تتضمن الرسالة معلومات حول الخطوات التالية، مثل تحديد موعد للجلسة الاستكشافية.",
  comunicationP3:"نقوم بتحديد موعد للجلسة الاستكشافية بناءً على جدول العميل وتوافر فريقنا.",
  comunicationP4:"في هذه الجلسة، يشارك متخصصون من فريقنا، مثل مدير المشروع، مصمم تجربة المستخدم وواجهة المستخدم، ومطور، لضمان فهم شامل لاحتياجات العميل.",
  comunicationP5:"نستخدم أدوات تفاعلية مثل Miro أو Zoom مع خاصية السبورة الافتراضية لتصور الأفكار والتحديات بشكل مرئي.",
  comunicationP6:"نقوم بطرح أسئلة على العميل حول الأهداف المحددة للمشروع، والجمهور المستهدف، والمنافسين الرئيسيين، وأي تفضيلات شخصية تتعلق بأنماط التصميم أو الميزات الخاصة.",
  
  designtitl:"تصميم تجربة وواجهة المستخدم",
  designP1:"بعد إعداد القائمة، نقوم بإجراء بحث شامل لفهم احتياجات المستخدمين النهائيين للمنتج. يتم تطوير شخصيات المستخدمين (User Personas) التي تمثل الفئات الأساسية من الجمهور المستهدف، مما يسهم في توجيه عملية التصميم والتطوير بشكل أفضل. نقوم أيضًا بإنشاء خرائط تدفق المستخدم (User Flow Diagrams) لتحديد كيفية تفاعل المستخدمين مع المنتج خطوة بخطوة.",
  designP2:"ثم نصمم النماذج الأولية (Prototypes) التي تُعرض على العميل في مراحل مختلفة للحصول على ملاحظاتهم القيمة. نستخدم أدوات مثل Figma وAdobe XD لهذا الغرض.",
  designP3:"بناءً على النماذج الأولية المعتمدة، نبدأ في تطوير تصميمات الواجهة، مع التركيز على الجمالية، وضوح الرسائل، وسهولة التنقل.",
  designP4:"نستخدم نظام تصميم متكامل (Design System) لضمان تناسق العناصر عبر جميع صفحات أو شاشات التطبيق.",
  designP5:"وفي النهاية، نقدم التصميم للعميل على شكل نماذج تفاعلية، مما يتيح له تجربة التفاعل مع المنتج كما لو كان حيا.",
  
  developTitl:"التطوير والبرمجة",
  developP1:"يبدأ المطورون في تحويل التصميمات المعتمدة إلى صفحات ويب أو شاشات تطبيق باستخدام تقنيات مثل HTML5 وCSS3 وJavaScript، أو من خلال استخدام إطارات العمل مثل React أو Angular.",
  developP2:"يتم اختبار الواجهة على مجموعة متنوعة من المتصفحات والأجهزة لضمان تجربة متسقة وسلسة عبر جميع المنصات.",
  developP3:"في الوقت نفسه، يعمل فريق تطوير البنية التحتية على بناء قاعدة البيانات وإعداد الخوادم باستخدام لغات برمجة مثل Python مع إطار Django أو PHP مع إطار Laravel.",
  developP4:"نقوم بإعداد واجهات برمجة التطبيقات (APIs) التي تعمل كحلقة وصل بين الواجهة الأمامية وقاعدة البيانات، مع التركيز على الأمان وسرعة الأداء. تشمل الإجراءات المتخذة تأمين البيانات باستخدام تقنيات التشفير، والحد من مخاطر الهجمات، وضمان الامتثال لمعايير حماية البيانات مثل GDPR.",
  developP5:"بعد ذلك، يتم إجراء اختبارات وحدات (Unit Tests) لكل مكون من الكود للتأكد من عمله بكفاءة واستقلالية قبل دمجه في النظام الأكبر.",
  developP6:"وأخيرًا، يتم تنفيذ اختبارات التوافق لضمان أن جميع مكونات النظام تعمل معًا بسلاسة. نستخدم أدوات مثل Postman لاختبار واجهات برمجة التطبيقات، وأدوات مثل Selenium لاختبار التفاعل بين الواجهة الأمامية والخلفية.",
 
  // ourWork

  ourworkTitl:"دراسات حالة تسلط الضوء على حلولنا الرقمية المبتكرة والناجحة.",
  ourworkP1:"أمثلة من أعمالنا مع علامات تجارية رائدة، وشركات نامية، وشركات ناشئة مدعومة برؤوس أموال استثمارية.",
  projectName:"الاسم",
  projTitl:"متجر الكتروني",
  projDec1:"وجهتكم المثالية للتسوق عبر الإنترنت! نقدم مجموعة متنوعة من المنتجات عالية الجودة، بدءًا من الأزياء والإكسسوارات إلى الإلكترونيات والأدوات المنزلية. يتميز متجرنا بتجربة تسوق سهلة ومريحة، حيث يمكنكم تصفح المنتجات بسهولة، إضافة العناصر إلى سلة التسوق، وإتمام عملية الدفع بأمان وسرعة.",
  projTit2:"متجر الكتروني",
  projDec2:"وجهتكم المثالية للتسوق عبر الإنترنت! نقدم مجموعة متنوعة من المنتجات عالية الجودة، بدءًا من الأزياء والإكسسوارات إلى الإلكترونيات والأدوات المنزلية. يتميز متجرنا بتجربة تسوق سهلة ومريحة، حيث يمكنكم تصفح المنتجات بسهولة، إضافة العناصر إلى سلة التسوق، وإتمام عملية الدفع بأمان وسرعة.",
       
  // contact with us

  contactTitl:"تواصل معنا ",
  contactTitl2:"لنجعل ثقتك تكتمل الان",
  contactDesc:"إن وصولك إلى هذه المرحلة يعني أنك قد بدأت في بناء جسر من الثقة بيننا. لذا دع هذه الثقة تنمو وتزدهر، وتحدث الآن إلى أحد خبراء التسويق لدينا. سيقودك هذا التواصل إلى تحقيق ما تطمح إليه. لا تتردد في كسر الحواجز، وتواصل معنا فورًا.",
  contactEmail:"البريد الالكتروني",
  contactName:"الاسم",
  contactMessage:"رسالتك",
  contactPhone:"الهاتف",
  contactBtn:"ارسال",
  contactlocation:"موقعك",

  servicetitl:"تحدث مع خدمه العملاء",
  contactPhoneDesc:"01147290516",
  whatsupnum:"الواتس",
  emailDesc:"dotcode16@gmail.com",
  locationtile:"الموقع",
  locationDesc:"مصر القاهره",
  




};
