export const Arabic = {
  test: "مرحبا احمد",
  // Header
  navLi1: "الرئيسية",
  navLi2: "الخدمات",
  navLi3: "الخطوات",
  navLi4: "اعمالنا",
  navLi5: "عنا",
  navBtn: "تواصل معنا",
  //ServicesNav
  servTitle1: "تصميم واجهة وتجربة مستخدم",
  servTitle2: "تطوير المواقع الالكترونية",
  servTitle3: "تطوير تطبيقات الهاتف",
  servDesc1:
    "نحرص على أن يكون كل تصميم نقوم به ليس مجرد مظهر؛ بل هو خطوة في بناء علاقة أقوى بين منتجك ومستخدميه.",
  servDesc2:
    "نحرص على أن يكون كل تفصيل في التطبيق مصممًا ومبرمجًا بعناية ليخدم رؤيتك.",
  servDesc3:
    "عندما يبدأ المستخدم رحلته مع تطبيقك، يجب أن تكون التجربة ملهمة وسلسة من اللحظة الأولى.",
  // Footer
  footerT1: "اجزاء الموقع",
  footerT2: "خدماتنا",
  footerT3: "تواصل معنا",
};
