export const Arabic = {
  test: "مرحبا احمد",
  // Header
  navLi1: "الرئيسية",
  navLi2: "الخدمات",
  navLi3: "الخطوات",
  navLi4: "اعمالنا",
  navLi5: "عنا",
  navBtn: "تواصل معنا",
  // home page
  //heroSec
  heroMainTitle:
    "حقق مشروع أحلامك بمساعدتنا وابتكر موقعك وتطبيقك مع خبراء التكنولوجيا.",
  heroMainText:
    "في سوق مليء بالمنافسة، التفوق الرقمي هو ما يميز القادة عن غيرهم. نسعى من خلال حلولنا المخصصة لتطوير المواقع والتطبيقات إلى تحقيق أهدافك وضمان نمو رقمي مستدام.",
  heroMainButton1: "عرض الخدمات",
  heroMainButton2: "تواصل معنا",
  // ourServices

  ourHomeServicesTitle: "خدماتنا",
  ourHomeServicesText: "انطلق في عالم التكنولوجيا المعقد و اكسب ثقة مستخدمينك.",
  ourHomeServicesUiuxTitle: "تصميم واجهة مستخدم",
  ourHomeServicesUiuxText:
    "لدينا مصممون مبدعون بإستطاعتهم أن يأخذوا مشروعك إلي أبعد الحدود و أن يرفعوا من ثقة عملائك بك عن طريق بناء تصميمات وجذابة ",
  ourHomeServicesUiuxLink: "تعرف علي التفاصيل",
  ourHomeServicesWebTitle: "تطوير المواقع الالكترونية",
  ourHomeServicesWebText:
    "بدون موقع الكتروني أنت غير مرئي و بدون موقع الكتروني مبني بواسطة محترفين أنت أيضًا غير مرئي؛ نضمن لك بناء موقع علي أيدي محترفين",
  ourHomeServicesWebLink: "تعرف علي التفاصيل",
  ourHomeServicesMobileTitle: "تطوير تطبيقات الهاتف",
  ourHomeServicesMobileText:
    "لدينا مطورون ذوي خبرة عالية جدًا و متمرسين في تطوير تطبيقات الهاتف المحمول من مصر، متخصصون في بناء برامج Android و IOS",
  ourHomeServicesMobileLink: "تعرف علي التفاصيل",
  // how do we work
  stepsHomeMainTitle: "ما هي خطواتنا؟",
  stepsHomeMainText: "هذا ما نفعله باختصار:",
  stepsHomeFirstTitle: "تواصل معنا",
  stepsHomeFirstText:
    "أرسل إلينا بريدًا إلكترونيًا يحتوي علي عنوان الخدمة مثل تطوير موقع أو تطوير تطبيق هاتف و سيتم الاتفاق علي موعد اجتماع منساب لك و لفريق العمل يتم فيه الاتفاق علي تفاصيل مشروعك و موعد الاستلام.",
  stepsHomeSecondTitle: "UI/UX",
  stepsHomeSecondText:
    "بعد فهم مشروعك بالكامل ودراسة المتسخدمين المستهدَفين من مشروعك يتم العمل علي إنشاء تجربة مستخدم سلسة و خرائط تدفق و تصميم النماذج الأولية و بعدها نعمل علي واجهة مستخدم مريحة وجذابة بإستخدام Figma و Adobe XD",
  stepsHomeThirdTitle: "التطوير و البرمجة",
  stepsHomeThirdText:
    "يبدأ المطورون بالعمل علي تحويل التصميمات المناسبة لك إلي صفحات ويب أو شاشة تطبيق بإستخدام Html5, css3, javascript أو بإستخدام أشهر إطارات العمل React بعدها يتم اختبار الواجهة علي جميع المتصفحات و الشاشات للتأكد من كفاءاتها. يعمل فريق الواجهة الخلفية علي قواعد البيانات و الخوادم بإستخدام NodeJS. ",
  number1: "١",
  number2: "٢",
  number3: "٣",
  // Testmonials
  testimonialsHomeTitle: "ماذا قال عملاؤنا عنا؟",
  testimonialsHomeText: "دعنا نشارك في نجاحك",
  customer1name: "أحمد محمد - Advanced Tech",
  customer2name: "سارة خالد - Digital Vision",
  customer3name: "علي يوسف - Smart World",
  customer4name: "نور إبراهيم - Software Innovations",
  customer5name: "ليلى حسن - Integrated Systems",
  customer6name: "يوسف عبد الله - Future Solutions",
  customer7name: "مريم عبد الرحمن - Creative Touch",
  customer8name: "خالد سليمان - Business Network",
  customer9name: "فاطمة عمر - Progressive Ideas",
  testimonialsHomeCustomer1:
    "خدمة متميزة! لقد أخذوا رؤيتنا وحولوها إلى موقع ويب رائع تجاوز توقعاتنا. تجربة المستخدم سلسة والتصميم من الدرجة الأولى!",
  testimonialsHomeCustomer2:
    "قام فريقهم بتطوير تطبيق جوال خالٍ من العيوب لنا. التصميم بديهي، ويعمل التطبيق بشكل مثالي عبر جميع الأجهزة. لا يمكن أن نكون أكثر سعادة بالنتائج!",
  testimonialsHomeCustomer3:
    "جئنا إليهم بفكرة، وأحيوها بتصميم إبداعي وتطوير احترافي. أصبح موقعنا الآن وظيفيًا وجذابًا بصريًا!",
  testimonialsHomeCustomer4:
    "الاهتمام بالتفاصيل في تصميم واجهة المستخدم وتجربة المستخدم كان مثيرًا للإعجاب. لقد صنعوا واجهة جميلة وسهلة الاستخدام، مما حسن بشكل كبير تجربة عملائنا.",
  testimonialsHomeCustomer5:
    "لقد استغرق فريق Dot Code الوقت لفهم رؤيتنا وقاموا بتسليم موقع وتطبيق جوال جميل وسهل الاستخدام. كان انتباههم للتفاصيل في مراحل التصميم والتطوير مثيرًا للإعجاب. كنا على اطلاع طوال العملية، وكانت النتيجة النهائية تفوق توقعاتنا!",
  testimonialsHomeCustomer6:
    "من الاجتماع الأول إلى التسليم النهائي، كانوا محترفين للغاية ومتجاوبين. يعمل تطبيقنا بسلاسة والتصميم يبدو رائعًا!",
  testimonialsHomeCustomer7:
    "كنا بحاجة إلى تطبيق مخصص لأعمالنا، وقد قدموا بالضبط ما تصورناه. كانت عملية التعاون سهلة، والمنتج النهائي كان مذهلاً!",
  testimonialsHomeCustomer8:
    "تجربتنا مع خدمات تطوير الويب الخاصة بهم كانت استثنائية. لقد فهموا احتياجات أعمالنا وأنشأوا موقعًا يعكس علامتنا التجارية بشكل مثالي.",
  testimonialsHomeCustomer9:
    "تجربتنا مع خدمات تطوير الويب الخاصة بهم كانت استثنائية. لقد فهموا احتياجات أعمالنا وأنشأوا موقعًا يعكس علامتنا التجارية بشكل مثالي.",

  //creative section
  creativeHomeSectionTitle: "ليس الإبداع فقط هو السر!",
  creativeHomeSectionText:
    "إبداعنا و ابتكارنا هو أساس نجاح مشروعك وسيادته في السوق؛ ولكن ليس فقط، بعد أن قطعنا أولي الخطوات معًا فلكي نصل إلي القمة علينا بالشراكة القوية معًا كي ندمج التواصل الدائم بيننا و نضمن ثبات مشروعك وكماله الرقمي دائمًا و أبدًا. فكل هذا تجده فقط في",
  creativeHomeSectionLink: "عرض المزيد",
  //ServicesNav
  servTitle1: "تصميم واجهة وتجربة مستخدم",
  servTitle2: "تطوير مواقع الويب",
  servTitle3: "تطوير تطبيقات الهاتف",
  servDesc1:
    "نركز في كل تصميم على تقديم تجربة متكاملة تجمع بين الجمال والوظيفية، بهدف تعزيز العلاقة بين منتجك ومستخدميه.",
  servDesc2:
    "نعتني بكل التفاصيل في تصميم وبرمجة المواقع، لنقدم حلولًا تقنية متكاملة تدعم رؤيتك وتحقق أهدافك بفعالية.",
  servDesc3:
    "عندما يبدأ المستخدم رحلته مع تطبيقك، يجب أن تكون التجربة ملهمة وسلسة من اللحظة الأولى.",

  // Footer
  footerT1: "اجزاء الموقع",
  footerT2: "خدماتنا",
  footerT3: "تواصل معنا",

  // Ui UX Service
  uiuxHeroTitle: "تصميم واجهات المستخدم وتجربة الاستخدام.",
  uiuxHeroText:
    "نحن نصمم تجربة شاملة تمنح المستخدمين إحساسًا بالانغماس في بيئة مريحة تحفزهم على التفاعل والعودة مجددًا. كل تصميم نقدمه لا يقتصر على الشكل فحسب؛ بل يمثل جزءًا من تعزيز الروابط بين منتجك والمستخدمين، حيث يتلاقى الجمال مع الأداء في تجربة تتخطى التوقعات. ولا نسعي لتحسين واجهتك فقط !",
  uiuxTextSectionTitle: " كيف يكون تأثير واجهة المستخدم",
  uiuxTextSectionText1:
    "تخيل واجهة رقمية تتميز بالجمال، وتضمن تجربة سلسة في كل نقرة وحركة. هذا هو جوهر خدماتنا في تصميم واجهة وتجربة المستخدم (UI/UX). نحن نقوم بتحويل الأفكار إلى تجارب رقمية مفعمة بالحياة، حيث يشعر المستخدمون بالراحة والانجذاب منذ البداية.",
  uiuxTextSectionText2:
    "نبدأ بفهم رؤيتك ومتطلبات جمهورك، ونحولها إلى تصميمات مدهشة تشد الانتباه وتدفع للتفاعل. نركز على تنسيق جميع عناصر التصميم، مما يجعل المستخدمين يشعرون وكأنهم في مكان مألوف يدعوهم للاكتشاف والعودة.",
  uiuxTextSectionText3:
    "تصميماتنا ليست مجرد أشكال خارجية؛ بل تمثل مدخلاً تفاعليًا يصل إلى قلوب المستخدمين، ويخلق رابطًا قويًا بين منتجك وجمهورك. نحن نبني واجهات تجعل المستخدمين يشعرون بأنهم جزء من تجربة متكاملة تتجاوز توقعاتهم.",
  uiuxWhyWe1Title: "تصاميم إبداعية",
  uiuxWhyWe1Text:
    "كل تصميم يبدأ بفكرة، لكن التحويل الحقيقي لهذه الفكرة إلى قصة بصرية مؤثرة هو ما يميز الإبداع. نحن نبدأ بفهم رؤيتك وأهدافك، ونبتكر تصاميم تعكس هوية علامتك التجارية. كل عنصر في التصميم، سواء كان خطًا أو لونًا أو تفصيلًا، يترجم فكرتك بوضوح.",
  uiuxWhyWe2Title: "تحليل الجمهور المستهدف",
  uiuxWhyWe2Text:
    "نستوعب جمهورك بعمق، مما يسمح لنا بإنشاء واجهات تتناسب مع اهتماماتهم وسلوكياتهم. هذا الفهم الدقيق يضمن أن المنتج النهائي ليس فقط جذابًا بل يتفاعل بفعالية مع احتياجات المستخدمين.",
  uiuxWhyWe3Title: "حلول فعالة",
  uiuxWhyWe3Text:
    "نقدم حلول تطوير برمجية فعّالة تركز على تعزيز الأداء وزيادة الكفاءة، لضمان تحقيق أهدافك بأفضل شكل ممكن. باستخدام أحدث التقنيات وأفضل الممارسات، نبتكر حلولًا تساهم في تحقيق نتائج ملموسة وملحوظة.",
  whyWe4Title: "تعاون مستمر معك",
  whyWe4Text:
    "نؤمن أن أفضل النتائج تأتي من التعاون المستمر. نبقى على تواصل معك في كل مراحل التصميم، ونستمع لملاحظاتك، ونعمل جنبًا إلى جنب لضمان أن المنتج النهائي يفوق توقعاتك.",
  whyWe5Title: "دعم مستمر",
  whyWe5Text:
    "رحلتك معنا لا تتوقف عند إطلاق موقعك أو تطبيقك. نقدم لك دعمًا  مستمرًا لضمان بقاء منتجك الرقمي في أفضل حالاته. سواء كنت بحاجة إلى تحديثات دورية، إصلاحات عاجلة، أو تحسينات في الأداء، نحن هنا لدعمك في كل مرحلة.",
  // Web Service
  webHeroTitle: "تطوير و بناء المواقع الالكترونية",
  webHeroText:
    "كل مشروع ويب نبدأه بفكرة تلبي احتياجاتك وتحقق طموحاتك. نحول هذه الفكرة إلى واقع رقمي عبر برمجة دقيقة. نطور تطبيقات ويب عالية الأداء بتجربة مستخدم سلسة، مع اهتمام كامل بكل التفاصيل لتحقيق رؤيتك.",
  webTextSectionTitle: "كيف نجعل موقعك الالكتروني",
  webTextSectionText1:
    "كل مشروع لتطوير تطبيق ويب يبدأ بفكرة، ووراءها فريق متخصص يقوم بتحويل هذه الفكرة إلى واقع ملموس. نحن لا نقتصر على البرمجة فقط، بل نصمم تطبيقات ويب تتميز بالقوة، وكفاءة الأداء، وتجربة مستخدم متكاملة. نحن لا نصنع تطبيقات ويب فقط، بل نخلق تجارب رقمية تمثل مستقبل أعمالك وتضعك في مقدمة السوق. نستخدم أحدث التقنيات لضمان أن يكون تطبيقك ليس فعالًا فحسب، بل يتفوق في السوق ويخدم جمهورك بأفضل شكل.",
  webTextSectionText2:
    "لكن السر في النجاح يكمن في الخطوات التي تلي هذه الفكرة. كل عنصر في التصميم والبرمجة يتمتع بعناية دقيقة لضمان أن تكون النتيجة النهائية منتجًا رقميًا يلفت الانتباه ويحقق احتياجات المستخدمين. وهذا يعني أنه ليس جاهزًا للإطلاق فحسب، بل مستعد لتحقيق النجاح المستدام.",
  webWhyWe1Title: "تجربة متقدمة",
  webWhyWe1Text:
    "استمتع بتجربة مستخدم متقدمة باستخدام أحدث تقنيات تطوير الويب، حيث نوفر لك تجربة تصفح سلسة وسهلة. نعمل على تحسين كل تفاصيل التفاعل لضمان تقديم تجربة مميزة تعزز رضا المستخدمين.",
  webWhyWe2Title: "مواقع مبتكرة",
  webWhyWe2Text:
    "نمزج بين الإبداع والتكنولوجيا لتصميم مواقع إلكترونية مبتكرة تلبي احتياجات عملك وتفوق توقعاتك. نستخدم تقنيات متطورة وأفكارًا جديدة لضمان تقديم حلول فريدة تدعم نمو عملك في كل مشروع.",
  webWhyWe3Title: "تصميم متجاوب",
  webWhyWe3Text:
    "في عالم يتطلب الاتصال المستمر، يجب أن يعمل موقعك بسلاسة على جميع الأجهزة. نحن نصمم مواقع متجاوبة تتأقلم مع مختلف أحجام الشاشات لضمان تجربة مستخدم سلسة ومتكاملة، بغض النظر عن كيفية وصولهم إلى الموقع.",
  // Mobile Service
  mobileHeroTitle: "تطوير تطبيقات الهاتف",
  mobileHeroText:
    "عند بدء المستخدم رحلته في تطبيقك، يجب أن تكون التجربة سلسة وجذابة منذ البداية. نفهم أن تطوير التطبيقات ليس مجرد برمجة، بل هو قصة تُحكى مع كل تفاعل. نصمم تطبيقات تجذب المستخدمين وتأخذهم في تجربة متكاملة، من واجهة مميزة إلى وظائف ذكية.",
  mobileTextSectionTitle: "كيف نأخذ تطبيقك إلي أبعد",
  mobileTextSectionText1:
    "نحن نفهم أن التفاعل بين المستخدم وتطبيقك هو ما يحدد نجاحه في سوق مليء بالتطبيقات. كل تطبيق لديه قصة فريدة تستحق أن تروى، ومهمتنا هي تحويل رؤيتك إلى تطبيق مميز يجذب انتباه المستخدمين منذ اللحظة الأولى ويضمن تجربة تجذبهم للعودة مرة أخرى. نبدأ بدراسة جمهورك المستهدف واحتياجاته لضمان تصميم تطبيق يلبي توقعاتهم ويحقق رغباتهم بشكل دقيق.",
  mobileTextSectionText2:
    "كل جزء من التطبيق، من التصميم البصري إلى الأداء الوظيفي، يهدف إلى تعزيز هوية علامتك التجارية. ندمج أحدث التقنيات مع إبداع التصميم لنضمن تجربة مستخدم سلسة وممتعة. كما نضمن أن يعمل التطبيق بكفاءة على مختلف الأجهزة وأنظمة التشغيل، مع تحسينات للأداء لضمان سرعة واستجابة عالية.",
  mobileTextSectionText3:
    "نحن هنا لنتأكد من أن التطبيق يتجاوز كونه أداة ليصبح تجربة متكاملة تخلق جسوراً من الثقة والولاء بينك وبين جمهورك. من خلال تعاوننا، سنصنع تطبيقاً لا يقتصر على جذب الانتباه، بل يحافظ عليه، محولاً كل تفاعل إلى لحظة ملهمة يرغب المستخدمون في مشاركتها.",
  mobileWhyWe1Title: " أداء متميز",
  mobileWhyWe1Text:
    "نؤمن أن نجاح أي تطبيق يتوقف على أدائه وفعاليته. لذا، نركز على تطوير تطبيقات تتمتع بأداء رائع وسهولة في الاستخدام، مما يضمن تجربة استثنائية لمستخدميك ويعزز تفاعلهم مع خدماتك.",
  mobileWhyWe2Title: "فعالية مضمونة",
  mobileWhyWe2Text:
    "في مجال تطوير التطبيقات، تعتبر الفعالية والجودة ليست مجرد خيارات بل هما الركيزتان الأساسيتان. نحن ملتزمون بتقديم حلول تقنية تجمع بين الأداء الموثوق والجودة العالية لضمان نجاح مشاريعك الرقمية.",
  mobileWhyWe3Title: "كفاءة لا تضاهى",
  mobileWhyWe3Text:
    "نطمح لتحقيق كفاءة عالية في التطبيقات في كل مشروع. نحن نعمل بجد لضمان توفير حلول برمجية تتوافق مع معايير صارمة للجودة والأداء، مما يضمن لك تطبيقات تتميز بالسرعة والفعالية.",
  // common service hero section button
  heroBtnText: "ابدأ رحلتك",
  // get your offer now section
  getYourOfferTitle: "استلم عرضك اليومي فوراً !",
  getYourOfferText: "عند الطلب من خلال الموقع ستحصل علي عرض خاص بك.",
  // service projects
  serviceProjectsTitle: "أعمالنا الناجحة التي تحكي عن",
  // whyWe Section
  whyWeTitle: "لماذا تختارنا نحن؟",

  // DailyOffer
  dO_h1: "لا تتردد، انضم إلينا واطلب عرضك اليومي الآن!",
  dO_p: "عند تقديم طلبك عبر الموقع، ستحصل على عرض خاص لك",
  dO_btn: "تواصل معنا",
  // TeamDC
  teamTitle: "فريقنا المبدع",
  teamDesc:
    "نعمل جاهدين على تطبيق أفكارك بإبداع لتعزيز هوية علامتك التجارية على أرض الواقع.",
  FED1: "احمد الكواوي",
  FED2: "محمود امين",
  FED3: "امير مسلم",
  FED4: "ايه فرح",
  BED1: "عبد الرحمن شرف",
  BED2: "رحمه عاطف",
  // FLD1: "احمد ايمن",
  UiUxD1: "علا اشرف",
  UiUxD2: "ندي عبد الرازق",
  PM: "محمد الشهابي",
  // About Us

  aboutHidding1: "السلام عليكم 👋  ",
  aboutHidding2: "تعرف علي",
  aboutHidding3: "دوت كود",
  aboutDes1: "نحن نقدم لعملائنا حزمة متكاملة من الحلول البرمجية المتطورة,",
  aboutDes2:
    "تشمل تطوير مواقع الويب، تصميم واجهات وتجربة مستخدم مبتكرة، بالإضافة إلى تطوير تطبيقات الجوال بمستوى عالٍ من الاحترافية. هدفنا هو تحويل أفكاركم إلى واقع رقمي يحقق طموحاتكم",
  whotitl: "من نحن ؟",
  ourworkBtn: "عرض العمل",
  whoDes1:
    "في دوت كود، نعمل بشغف لتوفير حلول تقنية متكاملة، نركز فيها على تطوير التطبيقات والمواقع الإلكترونية بشكل مخصص لتلبية متطلبات عملك المتغيرة. فريقنا يضم نخبة من المتخصصين في مجالات تطوير البرمجيات وتصميم تجربة المستخدم وواجهة المستخدم (UI/UX)، مما يتيح لنا تقديم حلول إبداعية تسهم في تعزيز تجربة المستخدم وتحقيق أقصى درجات التفاعل الرقمي.",
  whoDes2:
    "نلتزم باستخدام أحدث التقنيات وأفضل الممارسات العالمية، لضمان تقديم خدمات برمجية ذات كفاءة عالية وقابلية للتوسع، مما يضمن لك أداءً موثوقًا ومستقرًا على المدى الطويل. سواء كنت بحاجة إلى إنشاء منصة تجارة إلكترونية، تطوير تطبيق مخصص، أو بناء حلول برمجية متقدمة تلبي متطلباتك، فإن خبرتنا العميقة تمكننا من تحويل رؤيتك إلى واقع رقمي يلبي تطلعاتك.",
  whoDes3:
    "نتعاون مع عملاء من مختلف المجالات والصناعات، ونلتزم بتقديم دعم فني مستمر وخدمات صيانة دورية للحفاظ على أداء تطبيقاتك ومواقعك بأفضل صورة ممكنة. نحن نؤمن بأن سر نجاح أي مشروع يكمن في بناء علاقات شراكة طويلة الأمد مع عملائنا، لذلك نحرص على تقديم استشارات مهنية وخطط تطوير استراتيجية، مستندة إلى فهم دقيق لاحتياجات العملاء والسوق المستهدف.",
  whoDes4:
    "هدفنا لا يقتصر على تقديم حلول برمجية فقط، بل نسعى لتمكين عملائنا من تحقيق النمو المستدام وتوسيع نطاقهم الرقمي. في دوت كود، نضع عملاءنا في صميم كل ما نقوم به، ونعمل على بناء تجارب رقمية مبتكرة تجعل من العالم الرقمي مساحة أكثر تميزًا وفعالية.",

  whyUs1: "لماذا نحن؟",
  whyUs2: "مزايا العمل معنا",
  whydec:
    "نقدم تصميمات عصرية وجذابة مدعومة بأحدث التقنيات، ونسعى باستمرار لتحقيق أفضل النتائج بأعلى معايير الجودة. نضمن لك أداءً متميزًا وقابلية كبيرة للتوسع، مما يهيئ مشاريعك للنمو والتطور المستدام على المدى البعيد.",
  Btn1: "الجوده",
  Btn2: "رد سريع",
  Btn3: "دعم مستمر",

  Btn1Dec:
    "تُعتبر الجودة من أهم أولوياتنا في تقديم الخدمات لعملائنا. نحن نسعى باستمرار لتقديم منتجات وخدمات بأعلى معايير الجودة، مع التركيز على التفاصيل الدقيقة لتحقيق أفضل النتائج. كفريق، نؤمن أن الجودة لا تعني فقط تلبية التوقعات، بل تجاوزها من خلال تطوير حلول مبتكرة ومتقنة. نعمل بجد على مراقبة وتحسين أدائنا بشكل مستمر لضمان أن كل ما نقدمه يعكس احترافية وإتقان، مما يساهم في بناء علاقات قوية وطويلة الأمد مع عملائنا.",
  Btn3Dec:
    "نركز على ضمان أن تكون كل تجربة للمستخدم سلسة وفعّالة وجذابة بصريًا. نعمل بشكل وثيق مع العملاء لفهم احتياجاتهم وتقديم حلول مخصصة، مع معالجة أي مشكلات بسرعة وبشكل استباقي. فريقنا دائمًا على استعداد لتطبيق التحسينات، وتحسين الأداء، وضمان توافق واجهة المستخدم مع أحدث الاتجاهات والتقنيات في التصميم. هذا الدعم المستمر يساعد عملاءنا على الحفاظ على تجربة مستخدم عالية الجودة والبقاء في الطليعة في المشهد الرقمي.",
  Btn2Dec:
    "يُعتبر الرد السريع جزءًا أساسيًا من تقديم خدمة عملاء متميزة. كفريق، نحرص على الاستجابة الفورية لجميع استفسارات العملاء لضمان معالجة أي أسئلة أو مشاكل قد تواجههم بسرعة وكفاءة. هذا النهج لا يساهم فقط في زيادة رضا العملاء، بل يعكس أيضًا التزامنا بتقديم تجربة دعم سلسة وفعّالة. نحن نسعى دائمًا لجعل التواصل مع العملاء بسيطًا ومباشرًا، مما يعزز الثقة ويعكس مدى احترافية الفريق واهتمامه الحقيقي باحتياجات العميل.",
  knowUsTitle: "اكتشف المزيد عنا!",
  knowUsP1:
    "نؤمن بأن التعرف على إمكانياتنا الحقيقية يبدأ من الاطلاع على اعمالنا وشراكاتنا الاستراتيجية. نلتزم بتقديم حلول برمجية شاملة تتوافق مع احتياجات السوق المتغيرة، مع الحرص الدائم على تحقيق أعلى مستويات الجودة والابتكار في كل مشروع.",
  knowUsP2:
    "ندعوك لاكتشاف مشاريعنا السابقة، التي تعكس شراكتنا المثمرة مع عملائنا وتبرز قدرتنا على تحويل الأفكار إلى حلول عملية ذات تأثير ملموس. هدفنا هو بناء مستقبل رقمي قوي، قائم على التعاون المستمر واستخدام أحدث التقنيات.",

  // steps
  stepsTitle: "كيف نحقق لك حضورًا مميزًا في العالم الرقمي ؟",
  stepsDesc:
    "وفقًا لاحتياجاتك والمرحلة الحالية لمشروعك، نقدم لك الدعم من خلال الوسائل التالية",

  comunication: "الاتصال الأولي",
  comunicationP1:
    "عند تقديم العميل لطلبه عبر النموذج المتاح على الموقع، يتم تصنيف الطلب وفقًا لنوع المشروع، سواء كان ذلك في تطوير المواقع، أو التطبيقات، أو تصميم الواجهات",
  comunicationP2:
    "يتلقى العميل رسالة بريد إلكتروني تحتوي على تفاصيل طلبه، مع شكر خاص على اهتمامه بخدماتنا. كما تتضمن الرسالة معلومات حول الخطوات التالية، مثل تحديد موعد للجلسة الاستكشافية.",
  comunicationP3:
    "نقوم بتحديد موعد للجلسة الاستكشافية بناءً على جدول العميل وتوافر فريقنا.",
  comunicationP4:
    "في هذه الجلسة، يشارك متخصصون من فريقنا، مثل مدير المشروع، مصمم تجربة المستخدم وواجهة المستخدم، ومطور، لضمان فهم شامل لاحتياجات العميل.",
  comunicationP5:
    "نستخدم أدوات تفاعلية مثل Miro أو Zoom مع خاصية السبورة الافتراضية لتصور الأفكار والتحديات بشكل مرئي.",
  comunicationP6:
    "نقوم بطرح أسئلة على العميل حول الأهداف المحددة للمشروع، والجمهور المستهدف، والمنافسين الرئيسيين، وأي تفضيلات شخصية تتعلق بأنماط التصميم أو الميزات الخاصة.",

  designtitl: "تصميم تجربة وواجهة المستخدم",
  designP1:
    "بعد إعداد القائمة، نقوم بإجراء بحث شامل لفهم احتياجات المستخدمين النهائيين للمنتج. يتم تطوير شخصيات المستخدمين (User Personas) التي تمثل الفئات الأساسية من الجمهور المستهدف، مما يسهم في توجيه عملية التصميم والتطوير بشكل أفضل. نقوم أيضًا بإنشاء خرائط تدفق المستخدم (User Flow Diagrams) لتحديد كيفية تفاعل المستخدمين مع المنتج خطوة بخطوة.",
  designP2:
    "ثم نصمم النماذج الأولية (Prototypes) التي تُعرض على العميل في مراحل مختلفة للحصول على ملاحظاتهم القيمة. نستخدم أدوات مثل Figma وAdobe XD لهذا الغرض.",
  designP3:
    "بناءً على النماذج الأولية المعتمدة، نبدأ في تطوير تصميمات الواجهة، مع التركيز على الجمالية، وضوح الرسائل، وسهولة التنقل.",
  designP4:
    "نستخدم نظام تصميم متكامل (Design System) لضمان تناسق العناصر عبر جميع صفحات أو شاشات التطبيق.",
  designP5:
    "وفي النهاية، نقدم التصميم للعميل على شكل نماذج تفاعلية، مما يتيح له تجربة التفاعل مع المنتج كما لو كان حيا.",

  developTitl: "التطوير والبرمجة",
  developP1:
    "يبدأ المطورون في تحويل التصميمات المعتمدة إلى صفحات ويب أو شاشات تطبيق باستخدام تقنيات مثل HTML5 وCSS3 وJavaScript، أو من خلال استخدام إطارات العمل مثل React أو Angular.",
  developP2:
    "يتم اختبار الواجهة على مجموعة متنوعة من المتصفحات والأجهزة لضمان تجربة متسقة وسلسة عبر جميع المنصات.",
  developP3:
    "في الوقت نفسه، يعمل فريق تطوير البنية التحتية على بناء قاعدة البيانات وإعداد الخوادم باستخدام لغات برمجة مثل Python مع إطار Django أو PHP مع إطار Laravel.",
  developP4:
    "نقوم بإعداد واجهات برمجة التطبيقات (APIs) التي تعمل كحلقة وصل بين الواجهة الأمامية وقاعدة البيانات، مع التركيز على الأمان وسرعة الأداء. تشمل الإجراءات المتخذة تأمين البيانات باستخدام تقنيات التشفير، والحد من مخاطر الهجمات، وضمان الامتثال لمعايير حماية البيانات مثل GDPR.",
  developP5:
    "بعد ذلك، يتم إجراء اختبارات وحدات (Unit Tests) لكل مكون من الكود للتأكد من عمله بكفاءة واستقلالية قبل دمجه في النظام الأكبر.",
  developP6:
    "وأخيرًا، يتم تنفيذ اختبارات التوافق لضمان أن جميع مكونات النظام تعمل معًا بسلاسة. نستخدم أدوات مثل Postman لاختبار واجهات برمجة التطبيقات، وأدوات مثل Selenium لاختبار التفاعل بين الواجهة الأمامية والخلفية.",

  // ourWork

  ourworkTitl: "دراسات حالة تسلط الضوء على حلولنا الرقمية المبتكرة والناجحة.",
  ourworkP1:
    "أمثلة من أعمالنا مع علامات تجارية رائدة، وشركات نامية، وشركات ناشئة مدعومة برؤوس أموال استثمارية.",
  projectName: "الاسم",
  projTitl: "متجر الكتروني",
  projDec1:
    "وجهتكم المثالية للتسوق عبر الإنترنت! نقدم مجموعة متنوعة من المنتجات عالية الجودة، بدءًا من الأزياء والإكسسوارات إلى الإلكترونيات والأدوات المنزلية. يتميز متجرنا بتجربة تسوق سهلة ومريحة، حيث يمكنكم تصفح المنتجات بسهولة، إضافة العناصر إلى سلة التسوق، وإتمام عملية الدفع بأمان وسرعة.",
  projTit2: "متجر الكتروني",
  projDec2:
    "وجهتكم المثالية للتسوق عبر الإنترنت! نقدم مجموعة متنوعة من المنتجات عالية الجودة، بدءًا من الأزياء والإكسسوارات إلى الإلكترونيات والأدوات المنزلية. يتميز متجرنا بتجربة تسوق سهلة ومريحة، حيث يمكنكم تصفح المنتجات بسهولة، إضافة العناصر إلى سلة التسوق، وإتمام عملية الدفع بأمان وسرعة.",

  // contact with us

  contactTitl: "تواصل معنا ",
  contactTitl2: "لنجعل ثقتك تكتمل الان",
  contactDesc:
    "إن وصولك إلى هذه المرحلة يعني أنك قد بدأت في بناء جسر من الثقة بيننا. لذا دع هذه الثقة تنمو وتزدهر، وتحدث الآن إلى أحد خبراء التسويق لدينا. سيقودك هذا التواصل إلى تحقيق ما تطمح إليه. لا تتردد في كسر الحواجز، وتواصل معنا فورًا.",
  contactEmail: "البريد الالكتروني",
  contactName: "الاسم",
  contactMessage: "رسالتك",
  contactPhone: "الهاتف",
  contactBtn: "ارسال",
  contactlocation: "موقعك",

  servicetitl: "تحدث مع خدمه العملاء",
  contactPhoneDesc: "01147290516",
  whatsupnum: "الواتس",
  emailDesc: "dotcode16@gmail.com",
  locationtile: "الموقع",
  locationDesc: "مصر القاهره",


 //ServicesNav
 servBtn: "ابدأ رحلتك",
 servTitle1: "تصميم واجهة وتجربة مستخدم",

 servDesc1:
   "نحرص على أن يكون كل تصميم نقوم به ليس مجرد مظهر؛ بل هو خطوة في بناء علاقة أقوى بين منتجك ومستخدميه.",

 servTitleSection2: "كيف تُحدث واجهة المستخدم المثالية فرقًا؟",
 servDescSection2:
   "تخيل واجهة رقمية ليست فقط جميلة، بل تجعل كل نقرة وكل حركة بديهية وسهلة. هذا هو جوهر خدماتنا في تصميم واجهة المستخدم وتجربة المستخدم (UI/UX) نحن نحول الأفكار إلى تجارب رقمية تنبض بالحياة، حيث يشعر المستخدمون بالراحة والانسجام منذ اللحظة الأولى نحن نبدأ بفهم رؤيتك واحتياجات جمهورك، ونحولها إلى تصميمات تأسر الانتباه وتجذب التفاعل. نحرص على أن تكون كل عناصر التصميم متناغمة، مما يجعل المستخدمين يشعرون وكأنهم في بيئة مألوفة وجذابة تدعوهم للاستكشاف والعودة مرارًا تجاربنا ليست مجرد تصاميم؛ إنها بوابة تفاعلية تسهل الوصول إلى قلب المستخدم، وتخلق رابطًا قويًا بين منتجك ومستخدميه. نحن نصنع الواجهات التي تجعل المستخدمين يشعرون بأنهم جزء من تجربة أكبر، تجربة تتفوق على التوقعات",

 servTitleSection3:
   "تأكد ان مشاريعك بين أيدي خبراء متمرسين في بناء المنتجات الرقمية.",
 servTitleSection3h1: "تصاميم مبدعة",
 servTitleSection3p1:
   "كل تصميم يبدأ بفكرة، لكن الإبداع الحقيقي هو ما يحول هذه الفكرة إلى قصة بصرية تجذب الأنظار وتأسر القلوب. نحن نبدأ رحلتنا معك بفهم رؤيتك وأهدافك، لننسج منها تصاميم مبتكرة تحكي حكاية علامتك التجارية. كل خط، لون، وتفصيل يعكس جوهر فكرتك",

 servTitleSection3h2: "تحليل جمهورك المستهدف",
 servTitleSection3p2:
   "نفهم جمهورك بشكل أعمق، مما يسمح لنا بتصميم واجهات تتوافق مع تفضيلاتهم وسلوكهم. هذا التحليل الدقيق يضمن أن المنتج النهائي ليس جذابًا فقط بل يتفاعل مع احتياجات المستخدمين بفعالية.",

 servTitleSection3h3: "البرمجة",
 servTitleSection3p3:
   "برمجة المواقع الإلكترونية تتضمن مجموعة من المهارات والتقنيات تُستخدم لإنشاء وتطوير مواقع الويب.",
 servTitleSection3h4: "اختبار التطبيق",
 servTitleSection3p4:
   "يتم إجراء اختبارات كاملة للتطبيق والتأكد من تشغيل تطبيق الموبايل على الأجهزة بشكل صحيح مثل اختبار الوظائف، الأداء، الأمان",

 servTitleSection5: "الأسئلة الشائعة",
 servq1Section5: "كيف ابدء ؟",
 servAnsw1Sectionanswer5:
   "كل ما عليك فعله الضغط علي ايقونة الواتساب الظاهرة امامك وسيتولي فريق الدعم المهمة.",
 servq2Section5: " هل تقدمون دعمًا فنيًا بعد إطلاق الموقع؟",
 servAnsw2Sectionanswer5:
   "نعم، نحن نقدم دعمًا فنيًا مستمرًا بعد إطلاق الموقع، يشمل ذلك الصيانة الدورية، التحديثات، وإصلاح أي مشاكل تقنية لضمان استمرارية عمل الموقع بكفاءة عالية",

 // web
 servTitle2: "تطوير المواقع الالكترونية",
 servDesc2:
   "نحرص على أن يكون كل تفصيل في التطبيق مصممًا ومبرمجًا بعناية ليخدم رؤيتك.",

 servWebTitleSection2: "كيف نأخذ الموقع الالكتروني الخاص بك إلى القمة؟",
 servWebDescSection2:
   "كل مشروع تطوير تطبيق ويب يبدأ بفكرة، بفريق متخصص يعمل على برمجة هذه الفكرة إلى واقع ملموس. ولكن سر التفوق يكمن في الخطوات التي تلي تلك الفكرة. نحن لا نقف عند حدود البرمجة فقط، بل نصنع تطبيقات ويب تتميز بالقوة، والأداء الفائق، وتجربة المستخدم المتكاملة. نستخدم أحدث التقنيات لضمان أن تطبيقك ليس فقط فعالًا، بل يتفوق في السوق ويخدم جمهورك على أفضل وجه",

 // Application
 servTitle3: "تطوير تطبيقات الهاتف",
 servDesc3:
   "عندما يبدأ المستخدم رحلته مع تطبيقك، يجب أن تكون التجربة ملهمة وسلسة من اللحظة الأولى.",

 servAppTitleSection2: "كيف يمكننا تحويل تطبيقك إلى قصة تأسر المستخدمين؟",
 servAppDescSection2:
   "في سوق مزدحم بالتطبيقات، الطريقة التي يتفاعل بها المستخدم مع تطبيقك هي ما يحدد نجاحه. نحن نؤمن بأن كل تطبيق لديه قصة فريدة تستحق أن تُروى. مهمتنا هي تحويل رؤيتك إلى تطبيق ينبض بالحياة، يأسر انتباه المستخدم من اللحظة الأولى، ويخلق تجربة تجعلهم يعودون للمزيد. نبدأ بفهم عميق لجمهورك المستهدف واحتياجاته، لنضمن أن يكون التطبيق مصممًا خصيصًا ليلبي توقعاتهم ويحقق رغباتهم.",

};
